frontend/views/site/index.php

/* @var $this yii\web\View */

$this->title = 'Trade in Industrial';
$data = \frontend\models\News::find()->where(['status'=>1])->limit(3)->all();
---
SELECT * FROM `news` WHERE `status`=1 LIMIT 3